# for i in range(0,50,5):  # range(start,end)
# 	print('---->',i)

'''
 while: 关键字   完成循环

完整结构:

 while 条件:
 	语句体(块)
 else:
 	语句体(块)



'''
# 打印1-10之间的数字
# for i in range(1,11):
# 	print(i)

i=1
while i<=10:  # 10<=10 True   11<=10  False  结束循环结构
	print(i)  # print(10)
	i+=1  # i=11

print('打印完毕')


# 打印1-30之间的所有3的倍数
# 方式1：
n=1
while n<=30:
	# 进入循环体
	if n%3==0:
		print('---->',n)
	# 改变n
	n+=1

print('*'*30)
# 方式2:
n=3
while n<=30:
	print('====>',n)
	n+=3

print('*'*30)
# 方式3: (不推荐)

n=3
while n<=30 and n%3==0:
	print('********>',n)
	n+=3

# 打印1-30之间的所有既是3的倍数还是5的倍数
n=1

while n<=30:
	if n%3==0 and n%5==0:
		print('----------------->',n)

	# 改变n的值
	n+=1

'''

使用while循环计算1-20的累加和

1+2+3+4+...+20

'''
sum_1=0
i=1
while i<=20:
	sum_1+=i
	i+=1

print('---->累加和是:',sum_1)


'''
打印三角形 

*      ----> 第一层1颗*
**     ----> 第二层2颗*
***    ----> 第三层3颗*
****
*****

嵌套循环

'''
# print('*')
# print('**')
# print('***')
# print('****')
# print('*****')

'''
分析:
1. 层数明确
2. 发现规律  层数与个数  
3. 用什么表示层，用什么表示*的个数

'''

ceng = 1

while ceng<=5:
	# 打印*
	# print('*'*ceng) 
	# 嵌套while循环
	count=1
	while count<=ceng:
		print('*',end='')

		count+=1

	ceng+=1
	print()  # 换行


# _____________________

# ceng = 5

# while ceng>=1:


# 	ceng -=1

# 打印 9*9的乘法表
'''
1*1 =1
1*2 =2  2*2=4
1*3 =3  2*3 =6  3*3=9
....
1*9=9   2*9=18  3*9=27.....
作业

'''


'''
 掷骰子

 1. 欢迎进入xxxx游戏
 2. 输入用户名，默认用户是没有币
 3. 提示用户充值买币（100块钱30币，充值必须是100的倍数，充值不成功可以再次充值）
 4. 玩一局游戏扣除2个币，猜大小（系统用随机数模拟骰子产生值）
 5. 只要猜对了奖励1个币，可以继续玩（想不想继续玩，也可以没有金币自动退出）

'''

